# <center> Exploring pandas DataFrame

Let's explore a dataset, created from a CSV file.

In [3]:
import pandas as pd

In [4]:
malformed_df = pd.read_csv('./resources/users_dirty.csv')
malformed_df.head()

                            this is not a header row
0  user_uuid;first_name;birthday;city;country;is_...
1  27859;Élodie Le Roux;1968-03-10;Berger-les-Bai...
2  31111;Margot Deschamps;1983-09-25;Clément-sur-...
3  25356;Bernard Lopes;1991-09-07;Danielboeuf;Tri...
4  34248;Dominique Vaillant de Delannoy;1986-12-0...

**Question**: What is wrong ??

We can add some attributes to the `read_csv` method.

In [6]:
wellformed_df = pd.read_csv('./resources/users_dirty.csv', sep=';', header=1)
wellformed_df.head()

,user_uuid,first_name,birthday,city,country,is_new_user
0,27859,Élodie Le Roux,1968-03-10,Berger-les-Bains,Émirats arabes unis,True
1,31111,Margot Deschamps,1983-09-25,Clément-sur-Mer,Géorgie,False
2,25356,Bernard Lopes,1991-09-07,Danielboeuf,Trinité et Tobago,True
3,34248,Dominique Vaillant de Delannoy,1986-12-02,Saint Dominique,Slovaquie,True
4,25123,Pierre Paul,1938-12-13,Sainte AdrienneBourg,Israël,False

We can add indexes to the dataframe. This is equivalent to:

```python
wellformed_df.set_index('user_uuid', inplace=True)
```

In [4]:
wellformed_df.index= wellformed_df.user_uuid
wellformed_df.head()

,user_uuid,first_name,birthday,city,country,is_new_user
user_uuid,,,,,,
27859,27859,Élodie Le Roux,1968-03-10,Berger-les-Bains,Émirats arabes unis,True
31111,31111,Margot Deschamps,1983-09-25,Clément-sur-Mer,Géorgie,False
25356,25356,Bernard Lopes,1991-09-07,Danielboeuf,Trinité et Tobago,True
34248,34248,Dominique Vaillant de Delannoy,1986-12-02,Saint Dominique,Slovaquie,True
25123,25123,Pierre Paul,1938-12-13,Sainte AdrienneBourg,Israël,False

# Basic Statistics

In [5]:
wellformed_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1000 entries, 27859 to 25666
Data columns (total 6 columns):
user_uuid      1000 non-null int64
first_name     1000 non-null object
birthday       1000 non-null object
city           1000 non-null object
country        1000 non-null object
is_new_user    1000 non-null bool
dtypes: bool(1), int64(1), object(4)
memory usage: 47.9+ KB

In [6]:
wellformed_df.describe()

          user_uuid
count   1000.000000
mean   29613.102000
std     2934.179438
min    24507.000000
25%    27128.000000
50%    29636.000000
75%    32151.500000
max    34564.000000

In [7]:
df = wellformed_df.copy() # Easier to manipulate

# Column Selection

2 possible methods:

In [ ]:
la méthode entre crochets est utile en cas despaces dans le nom de la colonne

In [8]:
df['city']

user_uuid
27859        Berger-les-Bains
31111         Clément-sur-Mer
25356             Danielboeuf
34248         Saint Dominique
25123    Sainte AdrienneBourg
                 ...
33401                  Boulay
33851                  Hoarau
30741                 Lacroix
29599       Ferrand-les-Bains
25666       Le Gall-les-Bains
Name: city, Length: 1000, dtype: object

In [9]:
df.city

user_uuid
27859        Berger-les-Bains
31111         Clément-sur-Mer
25356             Danielboeuf
34248         Saint Dominique
25123    Sainte AdrienneBourg
                 ...
33401                  Boulay
33851                  Hoarau
30741                 Lacroix
29599       Ferrand-les-Bains
25666       Le Gall-les-Bains
Name: city, Length: 1000, dtype: object

We can get unique list of countries:

In [ ]:
Metode : df.colonne.methode

In [10]:
df.country.unique()

array(['Émirats arabes unis', 'Géorgie', 'Trinité et Tobago', 'Slovaquie',
       'Israël', 'Guinée', 'Zimbabwe', 'Bahamas', 'Slovénie', 'Suisse',
       'Samoa', 'Libye', 'Jordanie', 'Roumanie', 'Canada', 'Qatar',
       'Namibie', 'Estonie', 'Guinée-Bissau', 'Nouvelle-Zélande',
       'Sri Lanka', 'Autriche', 'Tokelau', 'Guyane', 'Cocos (Îles)',
       'Bhoutan', 'Sainte Lucie', 'Gibraltar', 'Bolivie', 'Bouvet (Îles)',
       'Zaïre', 'Malte', 'Maldives (Îles)', 'Japon', 'Guadeloupe',
       'Sierra Leone', 'Dominique', 'États-Unis', 'Moldavie', 'Turquie',
       'Vierges (Îles)', 'Kirghizistan', 'Cameroun', 'Macédoine',
       'Pakistan', 'Mali', 'Zambie', 'Niue', 'Équateur',
       'São Tomé et Príncipe (Rép.)', 'Nauru', 'Seychelles', 'Oman',
       'Belize', 'Thailande', 'Christmas (Île)', 'Cook (Îles)', 'Mexique',
       'Chili', 'Polynésie française', 'Uruguay', 'Ouganda', 'Nicaragua',
       'Espagne', 'Swaziland', 'Guyane française', 'Maurice', 'Tuvalu',
       'Royaume-Uni', 'Nepal', 'République tchèque', 'Burkina Faso',
       'Grenade', 'Portugal', 'République centrafricaine', 'Kiribati',
       'Sahara Occidental', 'Pérou', 'Brunei',
       'Svalbard et Jan Mayen (Îles)', 'Algérie',
       'Fidji (République des)', 'Antilles néerlandaises', 'Benin',
       'Pitcairn (Îles)', 'Aruba', 'Inde', 'Mozambique', 'Anguilla',
       'Tonga', 'Irlande', 'Guatemala', 'Togo', 'Cayman (Îles)',
       'Jamaïque', 'Chypre', 'Hong Kong', 'Arabie saoudite', 'Irak',
       'Singapour', 'Tchad', 'Ouzbékistan', 'Luxembourg', 'Belgique',
       'France', 'Réunion (La)', 'Marshall (Îles)', 'Bosnie-Herzégovine',
       'Heard et McDonald (Îles)', 'Indonésie', 'Tadjikistan',
       'Rép. Dém. du Congo', 'Honduras', 'Gabon', 'Antigua et Barbuda',
       'Bangladesh', 'République Dominicaine', 'Gambie', 'Philippines',
       'Wallis et Futuna (Îles)', 'Iran', 'Mariannes du Nord (Îles)',
       'Yougoslavie', 'Falkland (Île)', 'Finlande', 'Cambodge',
       'Costa Rica', 'Argentine', 'Yemen', 'El Salvador', 'Lettonie',
       'Guinée Equatoriale', 'Grèce', 'Cap Vert', 'Italie', 'Islande',
       'Niger', 'Madagascar', 'Cuba', 'Ghana', 'Danemark', 'Suriname',
       'Russie', 'Papouasie-Nouvelle-Guinée', 'Vatican (Etat du)', 'Guam',
       'Mongolie', 'Nigeria', 'Érythrée', 'Angola',
       'Saint Pierre et Miquelon', 'Arménie', 'Sainte Hélène', 'Syrie',
       'Botswana', 'Azerbaïdjan', 'Lithuanie',
       'Territoires français du sud', 'Corée du Nord', 'Égypte',
       'Vanuatu', 'Porto Rico', 'Malaisie', 'Montserrat', 'Vietnam',
       'Macau', 'Sénégal', 'Bahrain', 'Lesotho', 'Taiwan', 'Brésil',
       'Hongrie', 'Kazakhstan', 'Saint-Kitts et Nevis', 'Libéria',
       'Saint Vincent et les Grenadines', 'Pologne', 'Mauritanie',
       'Mayotte', 'Norvège', 'Palau', 'Rwanda', 'Timor', 'Norfolk (Îles)',
       'Tanzanie', 'Martinique', 'Pays-Bas', 'Haïti', 'Venezuela',
       "Côte d'Ivoire", 'Croatie', 'Turkménistan',
       'Turks et Caïques (Îles)', 'Liechtenstein', 'Suède',
       'Saint-Marin (Rép. de)', 'Andorre', 'Ukraine', 'Paraguay',
       'Groenland', 'Liban', 'Monaco', 'Antarctique',
       'Micronésie (États fédérés de)', 'Laos', 'Panama',
       'Géorgie du Sud et Sandwich du Sud (Îles)', 'Allemagne',
       'Djibouti', 'Comores', 'Corée du Sud', 'Burundi', 'Féroé (Îles)',
       'Albanie', 'Somalie', 'Maroc',
       "Territoire britannique de l'océan Indien",
       'Îles Mineures Éloignées des États-Unis', 'Bermudes (Les)',
       'Afrique du sud', 'Afghanistan', 'La Barbad',
       'Vierges britanniques (Îles)', 'Biélorussie', 'Tunisie', 'Malawi',
       'Koweit', 'Soudan', 'Colombie', 'Bulgarie', 'Nouvelle Calédonie',
       'Australie', 'Kenya'], dtype=object)

**How many different cities do we have? What is the distribution?**

In [11]:
len(df.country.unique())

233

In [12]:
df.country.value_counts()

Samoa                     11
Géorgie                   11
Turquie                   11
Fidji (République des)    10
Kirghizistan              10
                          ..
Comores                    1
Mozambique                 1
Japon                      1
Kenya                      1
Estonie                    1
Name: country, Length: 233, dtype: int64

In [13]:
df.country.value_counts(normalize=True)

Samoa                     0.011
Géorgie                   0.011
Turquie                   0.011
Fidji (République des)    0.010
Kirghizistan              0.010
                          ...
Comores                   0.001
Mozambique                0.001
Japon                     0.001
Kenya                     0.001
Estonie                   0.001
Name: country, Length: 233, dtype: float64

We can also select multiple columns at once:

Attention au double corchet pour appeler 2 colonnes :)

In [14]:
filtered_columns_df = df[['country', 'is_new_user']]
filtered_columns_df.head()

                       country  is_new_user
user_uuid
27859      Émirats arabes unis         True
31111                  Géorgie        False
25356        Trinité et Tobago         True
34248                Slovaquie         True
25123                   Israël        False

## Row Selection, Addition, and Deletion

### By Label (index)

We use `.loc` with the name of the index. d ou interêt de modifier l'index

In [15]:
df.loc[31111]

user_uuid                 31111
first_name     Margot Deschamps
birthday             1983-09-25
city            Clément-sur-Mer
country                 Géorgie
is_new_user               False
Name: 31111, dtype: object

### By Position

In [16]:
df.iloc[1]

user_uuid                 31111
first_name     Margot Deschamps
birthday             1983-09-25
city            Clément-sur-Mer
country                 Géorgie
is_new_user               False
Name: 31111, dtype: object

We can also select a subset of rows using `:`. The following is equivalent with 
```python 
df.iloc[10:100]
```

In [17]:
df[10:100]

,user_uuid,first_name,birthday,city,country,is_new_user
user_uuid,,,,,,
27298,27298,Dorothée Vidal-Gay,1965-03-26,Lopezdan,Suisse,True
27273,27273,Emmanuel Loiseau,1938-12-21,GonzalezBourg,Samoa,True
27047,27047,Julien Le De Oliveira,2001-11-12,Bertin,Libye,False
28931,28931,Inès Delannoy,1956-08-28,Fernandesdan,Jordanie,True
32382,32382,Benoît Becker,1978-12-07,Becker,Slovénie,True
...,...,...,...,...,...,...
33226,33226,Paulette Gros,1994-09-01,LemoineVille,Vierges (Îles),True
27897,27897,Gilles-Bernard Dupuy,1945-08-02,Bourdondan,Portugal,False
34025,34025,Léon Normand,1946-02-09,Reynaud,République centrafricaine,True
27393,27393,Juliette Weber,1932-08-24,Lelièvre,Kiribati,True
30223,30223,Zoé Tanguy,1985-03-21,Sainte Hortense,Sahara Occidental,True

## Filtering by value

It can be useful to filter dataframe per value sometimes.
To do so, we use the following syntax:

```python
df[df.column == filtered_value]
```

In [18]:
df[df.country == 'Suisse']

,user_uuid,first_name,birthday,city,country,is_new_user
user_uuid,,,,,,
27298,27298,Dorothée Vidal-Gay,1965-03-26,Lopezdan,Suisse,True
30539,30539,Nathalie Thomas,1972-05-06,Guilbert-sur-Bonnin,Suisse,False
25148,25148,Maggie Carlier,1957-11-02,Fontaine,Suisse,False
26834,26834,Claude Jacob-Bernard,1983-01-07,FernandesVille,Suisse,False
33362,33362,Marthe Roger,1949-04-28,Sainte François,Suisse,False
24893,24893,Juliette Poirier,1945-03-03,Saint Pénélope,Suisse,True
32775,32775,Henri Petit,1986-08-08,Poirier-la-Forêt,Suisse,True

The inside of the bracket `[...]` is a boolean serie.
Filtering rows is equivalent to filter rows where the Serie of the boolean is equal to `True`.

In [19]:
df.country == 'Suisse'

user_uuid
27859    False
31111    False
25356    False
34248    False
25123    False
         ...
33401    False
33851    False
30741    False
29599    False
25666    False
Name: country, Length: 1000, dtype: bool

We can use any comparison provided that the series is a boolean serie.

In [83]:
df[df.country.isin(['Suisse', 'Libye'])].sort_values(['country', 'is_new_user'])

,user_uuid,first_name,birthday,city,country,is_new_user
user_uuid,,,,,,
27047,27047,Julien Le De Oliveira,2001-11-12,Bertin,Libye,False
24988,24988,Luce Gallet,1980-06-08,Andre,Libye,False
25980,25980,Benjamin Peron,1961-08-01,Gérard,Libye,True
27986,27986,Lorraine Thibault,1986-03-25,Lamydan,Libye,True
32172,32172,Alexandrie Humbert de Étienne,1986-11-26,Boyer,Libye,True
30539,30539,Nathalie Thomas,1972-05-06,Guilbert-sur-Bonnin,Suisse,False
25148,25148,Maggie Carlier,1957-11-02,Fontaine,Suisse,False
26834,26834,Claude Jacob-Bernard,1983-01-07,FernandesVille,Suisse,False
33362,33362,Marthe Roger,1949-04-28,Sainte François,Suisse,False
27298,27298,Dorothée Vidal-Gay,1965-03-26,Lopezdan,Suisse,True
24893,24893,Juliette Poirier,1945-03-03,Saint Pénélope,Suisse,True
32775,32775,Henri Petit,1986-08-08,Poirier-la-Forêt,Suisse,True

Like so, we can have statistics on a subset of the dataset.
For example, only countries starting with the letter A.

In [90]:
country_with_A = df[df.country.str.startswith('A')]
country_with_A

,user_uuid,first_name,birthday,city,country,is_new_user
user_uuid,,,,,,
26285,26285,Lucas Lacroix,1982-11-23,GuillouVille,Autriche,True
30055,30055,Margot Maury de la Bonnin,1956-05-28,Allard,Autriche,False
33316,33316,Adrien Ferrand,1938-09-12,Gallet-sur-De Sousa,Algérie,True
34191,34191,Geneviève Laroche,1961-02-22,Chauvet,Antilles néerlandaises,True
30376,30376,Adèle Pasquier,1966-04-22,Saint CarolineBourg,Aruba,False
...,...,...,...,...,...,...
34249,34249,Susanne du Daniel,1948-07-26,BaronBourg,Antilles néerlandaises,True
28421,28421,Philippine Le Lopez,1960-04-12,Durand,Anguilla,True
25588,25588,Valentine de la Perrier,1995-12-30,Saint Marie-la-Forêt,Aruba,True
33334,33334,Claude De Oliveira,1978-12-12,Gimenez,Afghanistan,True
31121,31121,Sylvie Gonzalez,1971-05-16,Maréchaldan,Azerbaïdjan,False

In [91]:
country_with_A.is_new_user.value_counts()

True     38
False    32
Name: is_new_user, dtype: int64